[
  {
    "author": "蘇軾",
    "paragraphs": [
        "夫當今生民之患，果安在哉？在於知安而不知危，能逸而不能勞。此其患不見於今，而將見於他日。今不為之計，其後將有所不可救者。昔者先王知兵之不可去也，是故天下雖平，不敢忘戰。秋冬之隙，致民田獵以講武，教之以進退坐作之方，使其耳目習於鐘鼓旌旗之間而不亂，使其心志安於斬刈殺伐之際而不懾。是以雖有盜賊之變，而民不至於驚潰。及至後世，用迂儒之議，以去兵為王者之盛節，天下既定，則卷甲而藏之。數十年之後，甲兵頓弊，而人民日以安於佚樂，卒有盜賊之警，則相與恐懼訛言，不戰而走。開元、天寶之際，天下豈不大治？惟其民安於太平之樂，豢於游戲酒食之間，其剛心勇氣，銷耗鈍眊，痿蹶而不復振。是以區區之祿山一出而乘之，四方之民，獸奔鳥竄，乞為囚虜之不暇，天下分裂，而唐室固以微矣。",

      "蓋嘗試論之：天下之勢，譬如一身。王公貴人所以養其身者，豈不至哉？而其平居常苦於多疾。至於農夫小民，終歲勤苦，而未嘗告病。此其故何也？夫風雨、霜露、寒暑之變，此疾之所由生也。農夫小民，盛夏力作，而窮冬暴露，其筋骸之所沖犯，肌膚之所浸漬，輕霜露而狎風雨，是故寒暑不能為之毒。今王公貴人，處於重屋之下，出則乘輿，風則襲裘，雨則御蓋。凡所以慮患之具，莫不備至。畏之太甚，而養之太過，小不如意，則寒暑入之矣。是以善養身者，使之能逸而能勞；步趨動作，使其四體狃於寒暑之變；然後可以剛健強力，涉險而不傷。夫民亦然。今者治平之日久，天下之人驕惰脆弱，如婦人孺子，不出於閨門。論戰鬥之事，則縮頸而股慄；聞盜賊之名，則掩耳而不願聽。而士大夫亦未嘗言兵，以為生事擾民，漸不可長。此不亦畏之太甚，而養之太過歟？,",

      "且夫天下固有意外之患也。愚者見四方之無事，則以為變故無自而有，此亦不然矣。今國家所以奉西北二虜者，歲以百萬計。奉之者有限，而求之者無厭，此其勢必至於戰。戰者，必然之勢也。不先於我，則先於彼；不出於西，則出於北。所不可知者，有遲速遠近，而要以不能免也。天下苟不免於用兵，而用之不以漸，使民於安樂無事之中，一旦出身而蹈死地，則其為患必有不測。故曰：天下之民，知安而不知危，能逸而不能勞，此臣所謂大患也。,",

      "臣欲使士大夫尊尚武勇，講習兵法；庶人之在官者，教以行陣之節；役民之司盜者，授以擊刺之術。每歲終則聚於郡府，如古都試之法，有勝負，有賞罰。而行之既久，則又以軍法從事。然議者必以為無故而動民，又撓以軍法，則民將不安，而臣以為此所以安民也。天下果未能去兵，則其一旦將以不教之民而驅之戰。夫無故而動民，雖有小怨，然熟與夫一旦之危哉？,",

      "今天下屯聚之兵，驕豪而多怨，陵壓百姓而邀其上者，何故？此其心以為天下之知戰者，惟我而已。如使平民皆習於兵，彼知有所敵，則固以破其奸謀，而折其驕氣。利害之際，豈不亦甚明歟？"
    ],
    "title": "教戰守策"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "古之所謂豪傑之士者，必有過人之節[2]。人情有所不能忍者，匹夫見辱，拔劍而起，挺身而鬥，此不足為勇也。天下有大勇者，卒[3]然臨之而不驚，無故加之而不怒，此其所挾持[4]者甚大，而其志甚遠也。夫子房受書於圯[5]上之老人也，其事甚怪。然亦安知其非秦之世，有隱君子者出而試之。觀其所以微見其意者，皆聖賢相與警戒之義；而世不察，以為鬼物，亦已過矣。且其意不在書。",
        "當韓之亡，秦之方盛也，以刀鋸鼎鑊[6]待天下之士。其平居無事夷滅者，不可勝數。雖有賁、育[7]，無所獲施。夫持法太急者，其鋒不可犯，而其末可乘。子房不忍忿忿之心，以匹夫之力，而逞於一擊之間[8]；當此之時，子房之不死者，其間不能容髮[9]，葢亦危矣。千金之子，不死於盜賊，何者？其身可愛，而盜賊之不足以死也。子房以葢世之才，不為伊尹、太公之謀，而特出於荊軻[10]、聶政[11]之計，以僥倖於不死，此圯上老人所為深惜者也。是故倨傲鮮腆[12]而深折[13]之。彼其能有所忍也，然後可以就大事。故曰：「孺子[14]可教也。」",
        "楚莊王伐鄭[15]，鄭伯[16]肉袒牽羊[17]以迎；莊王曰：「其主能下人，必能信用其民矣。」遂舍之。勾踐之困於會稽[18]而歸，臣妾於吳者，三年而不倦。且夫有報人之志，而不能下人者，是匹夫之剛也。夫老人者，以為子房才有餘，而憂其度量之不足，故深折其少年剛銳之氣，使之忍小忿而就大謀。何則？非有平生之素[19]，卒然相遇於草野之間，而命以僕妾之役[20]，油然而不怪者，此固秦皇之所不能驚[21]，而項籍之所不能怒[22]也。",
        "觀夫高祖之所以勝，項籍之所以敗者，在能忍與不能忍之間而已矣。項籍唯不能忍，是以百戰百勝，而輕用其鋒；高祖忍之，養其全鋒，以待其弊[23]，此子房教之也。當淮陰破齊[24]而欲自王，高祖發怒，見於辭色。由此觀之，猶有剛強不忍之氣，非子房其誰全之？",
        "太史公疑子房以為魁梧[25]奇偉，而其狀貌乃如婦人女子，不稱其志氣。嗚呼！此其所以為子房歟！"
    ],
    "title": "留侯論"
  },
  {
    "author": "蘇軾",
    "paragraphs": ["亭以雨名，志喜也。",
        "古者有喜，則以名物，示不忘也。",
        "周公得禾，以名其書；漢武得鼎，以名其年；叔孫勝敵，以名其子。",
        "其喜之大小不齊，其示不忘壹也。",
        "　　予至扶風之明年，始治官舍。",
        "爲亭于堂之北，而鑿池其南，引流種木，以爲休息之所。",
        "是歲之春，雨麥于岐山之陽，其占爲有年。",
        "既而彌月不雨，民方以爲憂。",
        "越三月，乙卯乃雨，甲子又雨，民以爲未足。",
        "丁卯大雨，三日乃止。",
        "官吏相與慶于庭，商賈相與歌于市，農夫相與忭于野，憂者以喜，病者以愈，而吾亭適成。",
        "　　于是舉酒于亭上，以屬客而告之，曰：“五日不雨可乎？",
        "”曰：“五日不雨則無麥。",
        "”“十日不雨可乎？",
        "”曰：“十日不雨則無禾。",
        "”“無麥無禾，歲且薦饑，獄訟繁興，而盜賊滋熾。",
        "則吾與二三子，雖欲優遊以樂于此亭，其可得耶？",
        "今天不遺斯民，始旱而賜之以雨。",
        "使吾與二三子得相與優遊以樂于此亭者，皆雨之賜也。",
        "其又可忘耶？",
        "”",
        "　　既以名亭，又從而歌之，曰：“使天而雨珠，寒者不得以爲襦；使天而雨玉，饑者不得以爲粟。",
        "壹雨三日，伊誰之力？",
        "民曰太守。",
        "太守不有，歸之天子。",
        "天子曰不然，歸之造物。",
        "造物不自以爲功，歸之太空。",
        "太空冥冥，不可得而名。",
        "吾以名吾亭。",
        "”"
    ],
    "title": "喜雨亭記"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "生而眇(miao3)者不识日，问之有目者。或告之曰：“日之状如铜盘。”扣盘而得其声。他日闻钟，以为日也。或告之曰：“日之光如烛。”扪烛而得其形。他日揣 ，以为日也。 \n\n道之难见也甚于日，而人之未达也无异于眇。达者告之，虽有巧譬善导，亦无以过于盘与烛也。自盘而之钟，自钟而之龠yue4，转而相之，岂有既乎？故世之言道者，或即其所见而名之，或莫之见意之，皆求道之过也。 \n\n然则道卒不可求欤？苏子曰：“道可致而不可求。”何谓致？孙武曰：“善战者致人，不致于人。”子夏曰：“百工居肆，以成其事；君子学，以致其道。”南方多没水，日与水居也。七岁而能涉，十岁而能浮，十五而能没矣。夫没者岂苟然哉？必将有得于水之道者。日与水居，则十五而得其道；生不识水，则虽壮见舟而畏之。故北方之勇者，问于没人而求其所以没，以其言试之河，未有不溺者也。故凡不学而务求道，皆北方之学没者也。 \n\n昔者以声律取士，士杂学而不志于道；今世以经术取士，士知求道而不务学。渤海吴君彦有志于学者也，方求举于礼部，作《日喻》以告之。 "
    ],
    "title": "日喻"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "方山子，光黃間隱人也。少時，慕朱家、郭解爲人，閭里之俠皆宗之。稍壯，折節讀書，欲以此馳騁當世，然終不遇。晚乃遯於光黃間，曰岐亭。菴居蔬食，不與世相聞，棄車馬，毀冠服，徒步往來，山中人莫識也。見其所著帽，方聳而高，曰：「此豈古方山冠之遺像乎？」因謂之方山子。\n\n　　余謫居於黃，過岐亭，適見焉，曰：「嗚呼，此吾故人陳慥季常也，何爲而在此？」方山子亦矍然，問余所以至此者，余告之故。俯而不答，仰而笑，呼余宿其家。環堵蕭然，而妻子奴婢，皆有自得之意；余既聳然異之。\n\n　　獨念方山子少時，使酒好劍，用財如糞土。前十九年，余在岐山，見方山子從兩騎，挾二矢，遊西山。鵲起於前，使騎逐而射之，不獲；方山子怒馬獨出，一發得之。因與余馬上論用兵，及古今成敗，自謂一時豪士。今幾日耳，精悍之色，猶見於眉間，而豈山中之人哉？然方山子世有勳閥，當得官，使從事於其間，今已顯聞。而其家在洛陽，園宅壯麗，與公侯等；河北有田，歳得帛千匹，亦足以富樂。皆棄不取，獨來窮山中，此豈無得而然哉？余聞光黃間多異人，往往佯狂垢汙，不可得而見，方山子儻見之歟！"
    ],
    "title": "方山子傳"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "壬戌之秋，七月既望，蘇子与客汎舟游于赤壁之下。清風徐来，水波不興，舉酒属客，誦眀月之詩，歌窈窕之章。少焉，月出扵東山之上，裵回扵斗牛之閒，白露橫江，水光接天；縦一葦之所如，陵万頃之茫然。浩〻乎如憑虛御風，而不知其所止；飄〻乎如遺世獨立，羽化而登僊。\n\n扵是飲酒樂甚，扣舷而歌之。歌曰：「桂棹兮蘭槳，擊空眀兮泝流光。渺〻兮余懷，望羙人兮天一方。」客有吹洞簫者，𠋣歌而和之，其聲嗚嗚然，如怨、如慕、如泣、如訴，餘音嫋〻，不絶如縷。舞幽壑之潛蛟，泣孤舟之嫠婦。\n\n蘇子愀然，正襟危坐，而問客曰：「何為其然也？」\n\n客曰：「『月眀星稀，烏鵲南飛』此非曺孟德之詩乎？西望夏口，東望武昌，山川相繆，鬱乎蒼〻，此非孟德之困扵周郎者乎？方其破荆州，下江陵，順流而東也，舳艫千里，旌旗蔽空，釃酒臨江，橫槊賦詩，固一世之雄也，而今安在哉？況吾与子漁樵扵江渚之上，侣𩵋鰕而友麋鹿；駕一葉之扁舟，擧匏罇以相属。寄蜉蝣扵天地，渺浮海之一粟。哀吾生之須臾，羡長江之無窮。挟飛仙以遨游，抱眀月而長終。知不可乎驟得，託遺響扵悲風。」\n\n蘇子曰：「客亦知夫水与月乎？逝者如斯，而未甞往也；贏虛者如彼，而卒莫消長也，蓋将自其變者而觀之，則天地曽不䏻以一瞬；自其不變者而觀之，則物与我皆無盡也，而又何羡乎？且夫天地之閒，物各有主，苟非吾之所有，雖一毫而莫取。惟江上之清風，与山閒之眀月，耳得之而為聲，目遇之而成色，取之無禁，用之不竭，是造物者之無盡藏也，而吾与子之所共食。」\n\n客喜而笑，洗盞更〈平〉酌。肴核既盡，杯槃狼籍，相与枕藉乎舟中，不知東方之既白。\n\n軾去嵗作此賦，未甞輕出以示人，見者蓋一二人而已。\n\n欽之有使至求近文，遂親書以寄。多難畏事。\n\n欽之愛我，必深藏之不出也。又有後赤壁賦，筆倦未䏻冩，當俟後信。軾白。"
    ],
    "title": "前赤壁賦"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "　是歲十月之望，步自雪堂，將歸於臨皋。二客從予，過黃泥之坂。霜露既降，木葉盡脫，人影在地，仰見明月，顧而樂之，行歌相答。已而歎曰：「有客無酒，有酒無肴，月白風清，如此良夜何！」客曰：「今者薄暮，舉網得魚，巨口細鱗，狀如松江之鱸。顧安所得酒乎？」歸而謀諸婦。婦曰：「我有斗酒，藏之久矣，以待子不時之需。」於是攜酒與魚，復遊於赤壁之下。\n\n　　江流有聲，斷岸千尺；山高月小，水落石出。曾日月之幾何，而江山不可復識矣。予乃攝衣而上，履巉巖，披蒙茸，踞虎豹，登虬龍，攀棲鶻之危巢，俯馮夷之幽宮。葢二客不能從焉。劃然長嘯，草木震動，山鳴谷應，風起水湧。予亦悄然而悲，肅然而恐，凜乎其不可留也。反而登舟，放乎中流，聽其所止而休焉。\n\n　　時夜將半，四顧寂寥。適有孤鶴，橫江東來。翅如車輪，玄裳縞衣，戛然長鳴，掠予舟而西也。須臾客去，予亦就睡。夢一道士[1]，羽衣蹁躚，過臨皋之下，揖予而言曰：「赤壁之遊樂乎？」問其姓名，俛而不答。「嗚呼！噫嘻！我知之矣。疇昔之夜，飛鳴而過我者，非子也耶？」道士顧笑，予亦驚寤。開戶視之，不見其處。\n\n"
    ],
    "title": "後赤壁賦"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "　　匹夫而為百世師，一言而為天下法。是皆有以參天地之化，關盛衰之運。其生也，有自來；其逝也，有所為。故申、呂自嶽降，傅說為列星，古今所傳，不可誣也。孟子曰：「吾善養吾浩然之氣。是氣也，寓於尋常之中，而塞乎天地之閒。」卒然遇之，則王公失其貴，晉、楚失其富，良、平失其智，賁、育失其勇，儀、秦失其辯，是孰使之然哉？其必有不依形而立，不恃力而行，不待生而存，不隨死而亡者矣。故在天為星辰，在地為河嶽。幽則為鬼神，而明則復為人。此理之常，無足怪者。\n\n　　自東漢以來，道喪文弊，異端竝起，歷唐貞觀、開元之盛，輔以房、杜、姚、宋而不能救。獨韓文公起布衣，談笑而麾之，天下靡然從公，復歸於正，葢三百年於此矣。文起八代之衰，而道濟天下之溺，忠犯人主之怒，勇奪三軍之帥。豈非參天地，關盛衰，浩然而獨存者乎？\n\n　　蓋嘗論天人之辨，以謂人無所不至，惟天不容偽。智可以欺王公，不可以欺豚魚。力可以得天下，不可以得匹夫匹婦之心。故公之精誠，能開衡山之雲，而不能回憲宗之惑。能馴鱷魚之暴，而不能弭皇甫鎛、李逢吉之謗。能信於南海之民，廟食百世，而不能使其身一日安於朝廷之上。蓋公之所能者，天也。其所不能者，人也。\n\n　　始潮人未知學，公命進士趙德為之師。自是潮之士，皆篤於文行，延及齊民，至於今，號稱易治。信乎孔子之言：「君子學道則愛人，小人學道則易使也。」潮人之事公也，飲食必祭，水旱疾疫，凡有求，必禱焉。而廟在刺史公堂之後，民以出入為艱。前太守欲請諸朝，作新廟，不果。元祐五年，朝散郎王君滌來守是邦，凡所以養士治民者，一以公為師。民既悅服，則出令曰：「願新公廟者聽。」民懽趨之。卜地於州城之南七里，期年而廟成。\n\n　　或曰：「公去國萬里，而謫於潮，不能一歲而歸。沒而有知，其不眷戀於潮也審矣。」軾曰：「不然。公之神在天下者，如水之在地中，無所往而不在也。而潮人獨信之深，思之至，焄蒿悽愴，若或見之。譬如鑿井得泉，而曰水專在是，豈理也哉！」\n\n　　元豐元年，詔封公昌黎伯，故榜曰：昌黎伯韓文公之廟。潮人請書其事於石，因作詩以遺之，使歌以祀公。其辭曰：\n\n　　公昔騎龍白雲鄉，手抉雲漢分天章；\n　　天孫為織雲錦裳，飄然乘風來帝旁。\n　　下與濁世掃秕糠，西遊咸池略扶桑。\n　　草木衣被昭回光，追逐李、杜參翱翔；\n　　汗流籍、湜走且僵，滅沒倒影不能望。\n　　作書詆佛譏君王，要觀南海窺衡、湘，歷舜九嶷弔英皇，\n　　祝融先驅海若藏，約束蛟鱷如驅羊。\n　　鈞天無人帝悲傷，謳吟下招遣巫陽。\n　　犦牲雞卜羞我觴，於餐荔丹與蕉黃。\n　　公不少留我涕滂，翩然被髮下大荒。"
    ],
    "title": "潮州韓文公廟碑"
  },
  {
    "author": "蘇軾",
    "paragraphs": [
        "軾啟。近奉違，亟辱問訊，具審起居佳勝，感慰深矣。軾受性剛簡，學迂材下，坐廢累年，不敢復齒縉紳。自還海北，見平生親舊，惘然如隔世人，況與左右無一日之雅，而敢求交乎？數賜見臨，傾蓋如故，幸甚過望，不可言也。\n\n所示書教及詩賦雜文，觀之熟矣。大略如行雲流水，初無定質，但常行於所當行，常止於不可不止，文理自然，姿態橫生。孔子曰：「言之不文，行之不遠。」又曰：「辭達而已矣。」夫言止於達意，疑若不文，是大不然。求物之妙，如系風捕影，能使是物了然於心者，蓋千萬人而不一遇也。而況能使了然於口與手者乎？是之謂辭達。辭至於能達，則文不可勝用矣。揚雄好為艱深之詞，以文淺易之說，若正言之，則人人知之矣。此正所謂雕蟲篆刻者，其《太玄》、《法言》皆是類也。而獨悔於賦，何哉？終身雕蟲，而獨變其音節，便謂之經，可乎？屈原作《離騷經》，蓋風、雅之再變者，雖與日月爭光可也。可以其似賦而謂之雕蟲乎？使賈誼見孔子，升堂有余矣，而乃以賦鄙之，至與司馬相如同科！雄之陋，如此比者甚眾。可與知者道，難與俗人言也。因論文偶及之耳。歐陽文忠公言文章如精金美玉，市有定價，非人所能以口舌定貴賤也。紛紛多言，豈能有益於左右。愧悚不已。\n\n所須惠力法雨堂字。軾本不善作大字，強作終不佳，又舟中局迫難寫，未能如教。然軾方過臨江，當往遊焉。或僧有所欲記錄，當作數句留院中，慰左右念親之意。今日已至峽山寺，少留即去。愈遠。惟萬萬以時自愛。不宣。"
    ],
    "title": "與謝民師推官書"
  }
]